velioo_webserver_node/tests/ab_test_application_20.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8885

Document Path:          /application/test.txt
Document Length:        1000 bytes

Concurrency Level:      100
Time taken for tests:   23.836 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      106700000 bytes
HTML transferred:       100000000 bytes
Requests per second:    4195.28 [#/sec] (mean)
Time per request:       23.836 [ms] (mean)
Time per request:       0.238 [ms] (mean, across all concurrent requests)
Transfer rate:          4371.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.9      1      14
Processing:     8   23   6.1     20     110
Waiting:        2    8   3.5      7      48
Total:         14   24   6.1     21     111

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     23
  75%     27
  80%     30
  90%     32
  95%     34
  98%     37
  99%     41
 100%    111 (longest request)